Repository: magmax/pygrep
Catalog: old/pygrep3/po/*.po
Languages: es

source: Problems while opening file '%s': %s
es: Problemas al abrir el fichero '%s': %s

source: Unknown error opening file '%s': %s
es: Error desconocido al abrir el fichero '%s': %s

source: Empty string matching is not allowed
es: No están permitidas cadenas de coincidencia vacías

source: Image '%s' not found.
es: No se encuentra la imagen '%s'

source: Sorry. This is a BETA version.
es: Disculpe. Esta es una versión BETA.

source: It may not work well and may corrupt your profiles,
es: Puede que no funcione bien y corrompa sus perfiles,

source: so you must search for a release version.
es: por lo que debería buscar la versión definitiva.

source: Click CANCEL to abort or OK to continue with no warranty.
es: Pulse CANCELAR para salir o OK para continuar sin ninguna garantía.

source: Thank you.
es: Gracias.

source: #Matches
es: #Coincidencias

source: Filename
es: Nombre de fichero

source: Full Filename Path
es: Ruta completa al fichero

source: Size
es: Tamaño

source: Type
es: Tipo

source: Line
es: Línea

source: Text
es: Texto

source: <Do not use>
es: <No usar>

source: << You must enter here your search pattern >>
es: <<Debe introducir aquí el patrón a buscar>>

source: <b>BINARY LINE</b>.
es: <b>LÍNEA BINARIA</b>.

source: Profile Name
es: Nombre de perfil

source: The profile %s will be deleted forever. Are you sure?
es: El perfile %s se eliminará para siempre. ¿Está usted seguro?

source: Enabled
es: Habilitado

source: Pattern
es: Patrón

source: Add directory
es: Añadir directorio

source: Inclusions
es: Inclusiones

source: Set the Inclusion Pattern
es: Establecer el patrón de inclusión

source: Exclusions
es: Exclusiones

source: Set the Exclusion Pattern
es: Establecer el patrón de exclusión

source: Exclusion
es: Exclusión

source: Regular Expresion Editor...
es: Editor de expresiones regulares...

source: Toolbar Options
es: Opciones de la barra de herramientas

source: Do not show
es: No mostrar

source: Only Icons
es: Sólo iconos

source: Only Text
es: Sólo Texto

source: Icons and Text
es: Iconos y texto

source: Preferences
es: Preferencias

source: History
es: Historia

source: Edit Profile
es: Editar Perfil

source: Enable Regular Expresion mode
es: Habilitar modo con Expresiones Regulares

source: Regular Expresion
es: Expresión regular

source: Ignore the case in the pattern
es: Hace que el patrón no sea sensible a mayúsculas

source: Insensitive
es: No sensible a mayúsculas

source: Search complete words
es: Buscar palabras completas

source: By Word
es: Por palabra

source: Open your favourite brower with Pygrep site.
es: Abre su navegador favorito con el sitio web de Pygrep.

source: Help
es: Ayuda

source: Search
es: Buscar

source: Search on the files listed below, not in configured dirs
es: Buscar en los ficheros listados más abajo, no en los directorios configurados

source: Refine
es: Refinar

source: New Profile
es: Nuevo perfil

source: Name:
es: Nombre:

source: Profiles
es: Perfiles

source: <b>Profile List</b>
es: <b>Lista de Perfiles</b>

source: Bold
es: Negrita

source: Italic
es: Cursiva

source: Example of color
es: Ejemplo de color

source: Foreground:
es: Color de texto:

source: Background:
es: Color de fondo:

source: <b>File Match</b>
es: <b>Coincidencias de fichero</b>

source: File Pattern:
es: Patrón de fichero:

source: Path:
es: Ruta:

source: file
es: fichero

source: path/to/filename/file
es: ruta/al/nombre\_de\_fichero/fichero

source: <b>Example</b>
es: <b>Ejemplo</b>

source: File Match
es: Coincidencias de fichero

source: <b>Line Match (Line)</b>
es: <b>Coincidencias de línea (línea)</b>

source: <b>Line Match (Match)</b>
es: <b>Coincidencias de línea (coincidencia)</b>

source: Pattern:
es: Patrón:

source: Text:
es: Texto:

source: text
es: texto

source: This text is an example of lines that matchs the patterns. There is some lines that does not match. So, you can check if you like the text properties you choose. That's all.
es: Éste es un texto de ejemplo de líneas que coinciden con el patrón. Hay algunas líneas que no coinciden. De esta manera, se puede comprobar si le gustan las propiedades de texto que eligió. Eso es todo.

source: Line Match
es: Coincidencia de línea

source: <b>Pattern History</b>
es: <b>Histórico de patrones</b>

source: Profile Editor
es: Editor de perfiles

source: Lines to show before match:
es: Líneas a mostrar antes de la coincidencia:

source: Lines to show after match:
es: Líneas a motrar después de la coincidencia:

source: Search Options
es: Opciones de búsqueda

source: <i>For Example:</i> <tt> /usr/bin/emacs21 +%l %f /usr/bin/emacsclient -n -a /usr/bin/emacs +%l %f gedit +%l %f kate -u -l %l %f </tt>
es: <i>Por Ejemplo:</i> <tt> /usr/bin/emacs21 +%l %f /usr/bin/emacsclient -n -a /usr/bin/emacs +%l %f gedit +%l %f kate -u -l %l %f </tt>

source: Patterns: <b>%f</b> - File with path <b>%l</b> - Line number <b>%F</b> - File name <b>%P</b> - Path
es: Patrones: <b>%f</b> - Fichero con la ruta <b>%l</b> - Número de línea <b>%F</b> - Nombre de fichero <b>%P</b> - Ruta

source: Minimize after launching command
es: Minimizar después de lanzar la orden

source: <b>Command to execute</b>
es: <b>Orden a ejecutar</b>

source: Ignore files bigger than
es: Ignorar los ficheros mayores que

source: <b>File Limits</b>
es: <b>Límites de fichero</b>

source: Options
es: Opciones

source: <b>Directories to search in</b>
es: <b>Directorios en los que buscar</b>

source: Directories
es: Directorios

source: <b>Inclusion Patterns</b>
es: <b>Patrones de inclusión</b>

source: <b>Exclusion Patterns</b>
es: <b>Patrones de exclusión</b>

source: Patterns
es: Patrones

source: Regular Expresion:
es: Expresión regular:

source: This is a code of example. Here you can see some examples that may be useful to check your Regular Expresion. For example, you can see some C code: #include <stdio.h> int main (int argc, char* argv[]) { printf ("hello world\n"); return 0; } Or some Python code too: #!/usr/bin/env python # -*- coding: utf-8 -*- def main (): print "hello world" if __name__ == "__main__": main () Maybe HTML code: <html> <head> <title>Hello, world</title> </head> <body> <h1> Hello, world </h1> </body> </html> Or some lyrics: Join us now and share the software: you’ll be free, hackers, you’ll be free; join us now and share the software: you’ll be free, hackers, you’ll be free. And you can edit this text and change it for you favourite text.
es: Esto es un código de ejemplo. Aquí puede ver algunos ejemplos que pueden ser útiles para comprobar sus expresión regular. Por ejemplo, puede ver algo de código C: #include <stdio.h> int main (int argc, char* argv[]) { printf ("Hola mundo\n"); return 0; } O también algo de código Python: #!/usr/bin/env python # -*- coding: utf-8 -*- def main (): print "hola mundo" if __name__ == "__main__": main () Quizá código HTML: <html> <head> <title>Hola, mundo</title> </head> <body> <h1> Hola, mundo </h1> </body> </html> O letras de canciones: Uniros a nosotros y compartid el software: seréis libres, hackers, seréis libres; Uniros a nosotros y compartid el software: seréis libres, hackers, seréis libres. Y se puede editar este texto para cambiarlo por su texto favorito.

source: Sample Text
es: Texto de ejemplo

source: Matching Text
es: Texto coincidente
